Ракович_В_Ю_70189466/src/AccumulationRegisters/ИсторияПоказателейЗдоровья/ИсторияПоказателейЗдоровья.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИсторияПоказателейЗдоровья</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Значение</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОтклонениеОтНормы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДокументОснования</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Измерявший</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ПоказателиЗдоровья</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПериодИзмерения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Ракович_В_Ю_70189466/src/AccumulationRegisters/ИсторияПоказателейЗдоровья/ManagerModule.bsl
// Получить историю показателя для студента
Функция ПолучитьИсториюПоказателя(Студент, Показатель, ДатаНачала, ДатаОкончания) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    ИсторияПоказателейЗдоровья.ПериодИзмерения,
    |    ИсторияПоказателейЗдоровья.Значение,
    |    ИсторияПоказателейЗдоровья.ОтклонениеОтНормы,
    |    ИсторияПоказателейЗдоровья.Комментарий
    |ИЗ
    |    РегистрНакопления.ИсторияПоказателейЗдоровья КАК ИсторияПоказателейЗдоровья
    |ГДЕ
    |    ИсторияПоказателейЗдоровья.Студент = &Студент
    |    И ИсторияПоказателейЗдоровья.Показатель = &Показатель
    |    И ИсторияПоказателейЗдоровья.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
    |УПОРЯДОЧИТЬ ПО
    |    ИсторияПоказателейЗдоровья.Период";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("Показатель", Показатель);
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("ДатаОкончания", ДатаОкончания);
    
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции

// Получить последнее значение показателя
Функция ПолучитьПоследнееЗначение(Студент, Показатель) Экспорт
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ВЕРХ 1
    |    ИсторияПоказателейЗдоровья.Значение,
    |    ИсторияПоказателейЗдоровья.ПериодИзмерения
    |ИЗ
    |    РегистрНакопления.ИсторияПоказателейЗдоровья КАК ИсторияПоказателейЗдоровья
    |ГДЕ
    |    ИсторияПоказателейЗдоровья.Студент = &Студент
    |    И ИсторияПоказателейЗдоровья.Показатель = &Показатель
    |УПОРЯДОЧИТЬ ПО
    |    ИсторияПоказателейЗдоровья.Период УБЫВ";
    
    Запрос.УстановитьПараметр("Студент", Студент);
    Запрос.УстановитьПараметр("Показатель", Показатель);
    
    Результат = Запрос.Выполнить();
    Если Не Результат.Пустой() Тогда
        Выборка = Результат.Выбрать();
        Выборка.Следующий();
        Возврат Новый Структура("Значение,ПериодИзмерения", Выборка.Значение, Выборка.Период);
    КонецЕсли;
    
    Возврат Неопределено;
    
КонецФункции
